In [9]:
import pandas as pd

df=pd.read_csv('data.csv')
print(df)

      Name  Age  Gender          City  Salary  Experience   Department
0    Alice   30  Female      New York   70000           5  Engineering
1      Bob   25    Male   Los Angeles   60000           3    Marketing
2  Charlie   35    Male       Chicago   80000          10      Finance
3    David   28    Male       Houston   75000           4  Engineering
4      Eva   32  Female       Phoenix   72000           6       Design
5    Frank   29    Male  Philadelphia   68000           5    Marketing
6    Grace   31  Female   San Antonio   71000           7      Finance
7   Hannah   27  Female     San Diego   69000           4       Design
8    Jones   29    Male        Dallas   73000           5  Engineering
9    Harry   28    Male      San Jose   76000           6    Marketing

In [29]:
print(df.head())
print(df.tail())

# Only calculate mean for numeric columns
print(df.mean(numeric_only=True))

      Name  Age  Gender         City  Salary  Experience
0    Alice   30  Female     New York   70000           5
1      Bob   25    Male  Los Angeles   60000           3
2  Charlie   35    Male      Chicago   80000          10
3    David   28    Male      Houston   75000           4
4      Eva   32  Female      Phoenix   72000           6
     Name  Age  Gender          City  Salary  Experience
5   Frank   29    Male  Philadelphia   68000           5
6   Grace   31  Female   San Antonio   71000           7
7  Hannah   27  Female     San Diego   69000           4
8   Jones   29    Male        Dallas   73000           5
9   Harry   28    Male      San Jose   76000           6
Age              29.4
Salary        71400.0
Experience        5.5
dtype: float64